public static bool IsPassWord(string value)
    {
        //利用正则 
        //^ 匹配一行的开头位置
        //(?![0-9]+$) 预测该位置后面不全是数字
        //(?![a-zA-Z]+$) 预测该位置后台不全是字母
        //[0-9A-Za-z]{6-12} 由6-12位数字和字母组成
        Regex regex = new Regex(@"^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,12}$");
        if (regex.IsMatch(value))
            return true;
        return false;
    }

        //常用正则表达式
        //只能输入数字："^[0-9]*$"。
        //只能输入n位的数字："^\d{n}$"。
        //只能输入至少n位的数字："^\d{n,}$"。
        //只能输入m ~n位的数字：。"^\d{m,n}$"
        //只能输入零和非零开头的数字："^(0|[1-9][0-9]*)$"。
        //只能输入有两位小数的正实数："^[0-9]+(.[0-9]{2})?$"。
        //只能输入有1 ~3位小数的正实数："^[0-9]+(.[0-9]{1,3})?$"。
        //只能输入非零的正整数："^\+?[1-9][0-9]*$"。
        //只能输入非零的负整数："^\-[1-9][]0-9"*$。
        //只能输入长度为3的字符："^.{3}$"。
        //只能输入由26个英文字母组成的字符串："^[A-Za-z]+$"。
        //只能输入由26个大写英文字母组成的字符串："^[A-Z]+$"。
        //只能输入由26个小写英文字母组成的字符串："^[a-z]+$"。
        //只能输入由数字和26个英文字母组成的字符串："^[A-Za-z0-9]+$"。
        //只能输入由数字、26个英文字母或者下划线组成的字符串："^\w+$"。
        //验证用户密码："^[a-zA-Z]\w{5,17}$"正确格式为：以字母开头，长度在6 ~18之间，只能包含字符、数字和下划线。
        //验证是否含有^%&',;=?$\"等字符："[^%&',;=?$\x22]+"。
        //只能输入汉字："^[\u4e00-\u9fa5]{0,}$"
    }